<LazyPlotly
  data={[
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: Baseline T<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(214.0, 199.6, 223.6)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.10119109316468,
      0.00378184484000181,
      0.0371106863802083,
      0.00265476962648764,
      0.00550835226092959,
      0.0487582227802099,
      0.0556459903612565,
      0.113657527214595
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: T Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(181.0, 152.2, 200.2)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0141632795290131,
      0.0695407673994863,
      0.0473394997784037,
      0.0784881493634751,
      0.0536240312045645,
      0.0596970131081995,
      0.0127605967402739,
      0.0106508105580558
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: T Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(148.0, 104.80000000000001, 176.8)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.107454525825185,
      0.00777643493470113,
      0.0306695299319507,
      0.00472298003382548,
      0.0301546926324385,
      0.130929640429032,
      0.161059362112116,
      0.063088584992542
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: T Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(115.0, 57.400000000000006, 153.4)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0235451950793908,
      0.018305624318771,
      0.00598524374332788,
      0.00653873661995642,
      0.00460588830869391,
      0.00495975899710438,
      0.0630795458881943,
      0.014421272280685
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: T Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(82.0, 10.0, 130.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.000739929909560192,
      0.0182609878526616,
      0.034113788164308,
      0.0444449947795476,
      0.0114102602367573,
      0.00819174204359274,
      0.00222482477984374,
      0.000527599168382406
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: Baseline P<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(206.6, 217.6, 225.4)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.125954044935258,
      0.00836450717324947,
      0.0748790778061511,
      0.00466404062234534,
      0.028048414460805,
      0.116167192717629,
      0.101481617597714,
      0.0393390007433789
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: P Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(166.2, 188.2, 203.8)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0523250197259039,
      0.00866801047515188,
      0.025450889839959,
      0.0156476255687036,
      0.0312065020036041,
      0.16515788944343,
      0.0720739851838506,
      0.0154596721776828
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: P Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(125.80000000000001, 158.8, 182.2)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0496085001045642,
      0.00469330078456068,
      0.0955165980565461,
      0.00135658638680495,
      0.0139931176427207,
      0.0914607442661693,
      0.0720884409396375,
      0.033122831525689
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: P Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(85.4, 129.4, 160.6)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0137212515939984,
      0.00401235671510554,
      0.00336280580043419,
      0.0093783545611412,
      0.00241367366143264,
      0.00510715769636294,
      0.00993208316447313,
      0.00352915909495894
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: P Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(45.0, 100.0, 139.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.00171118027374014,
      0.0307557220681329,
      0.0376918177655092,
      0.106537758338596,
      0.00448592371074579,
      0.00362508684853361,
      0.000392745459049771,
      0.000333633556361976
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: Baseline SPI<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(198.8, 216.4, 205.8)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0409218837141068,
      0.00684650698642054,
      0.0120746450109568,
      0.0054127234312257,
      0.0192832248557213,
      0.0226517525133261,
      0.0139825065491598,
      0.0131079398875846
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: SPI Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(150.6, 185.8, 164.6)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.0420788904578072,
      0.0231023291176306,
      0.021831617807487,
      0.0365341574797545,
      0.0526295597731976,
      0.0344442508142313,
      0.0317114855049472,
      0.0131395222626322
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: SPI Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(102.39999999999998, 155.2, 123.39999999999999)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.121457252450241,
      0.00401966555078925,
      0.116197292398208,
      0.00132602585827762,
      0.0415185273394617,
      0.0514927865954129,
      0.0378259354056912,
      0.0240686648827645
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: SPI Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(54.19999999999999, 124.6, 82.19999999999999)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.00272323783732971,
      0.00176756929611967,
      0.00359876264118156,
      0.021768972793099,
      0.0102850462281427,
      0.00417185563804497,
      0.00202729807896699,
      0.00111746573886287
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคกลาง<br>Crop: %{y}<br>Var: SPI Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(6.0, 94.0, 41.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": true,
    "width": 0.5,
    "x": [
      0.00594871351270899,
      0.0133727724162515,
      0.0120673564285079,
      0.0209339134090108,
      0.00116027461953618,
      0.00678964939978355,
      0.00149832269413654,
      0.000859072691785544
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x",
    "yaxis": "y"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: Baseline T<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(214.0, 199.6, 223.6)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0276152088814589,
      0.000631623474488706,
      0.0437263370176516,
      0.00218909858610858,
      0.0219413817213659,
      0.0357921382117863,
      0.0699839259605633,
      0.0393033375622219
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: T Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(181.0, 152.2, 200.2)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0127454792926787,
      0.0352547717822874,
      0.0854909678754783,
      0.0722495493525422,
      0.00223226015896332,
      0.0181940534263849,
      0.0156649291216644,
      0.0162635103879845
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: T Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(148.0, 104.80000000000001, 176.8)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0929248080789618,
      0.00456744169545221,
      0.0136102745302615,
      0.00290572185464382,
      0.0410266742479091,
      0.0582426336096769,
      0.0683880303690905,
      0.0469455581678508
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: T Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(115.0, 57.400000000000006, 153.4)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0288041390744958,
      0.0145780392595552,
      0.0391726520236039,
      0.00833043895072611,
      0.0118750475206799,
      0.00823060244714602,
      0.00967568150862934,
      0.0122632624060256
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: T Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(82.0, 10.0, 130.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0125924919382309,
      0.0359399200385389,
      0.0127170178295395,
      0.0314020556323256,
      0.0116749075569054,
      0.0239743469488481,
      0.0151583264531055,
      0.0106875798599745
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: Baseline P<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(206.6, 217.6, 225.4)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.016558882361037,
      0.00110685733830074,
      0.0783676815142992,
      0.00145191963286042,
      0.0791795906514899,
      0.105225300796881,
      0.132692467327385,
      0.0906469869986534
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: P Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(166.2, 188.2, 203.8)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00484800509550113,
      0.00345552171862732,
      0.0199019957501725,
      0.0117982875622435,
      0.00751608115747418,
      0.0379012792690119,
      0.0322175364108689,
      0.0302265888379905
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: P Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(125.80000000000001, 158.8, 182.2)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0269837466800297,
      0.000760901860037886,
      0.0610200100891855,
      0.00173081495093601,
      0.047098258191965,
      0.203598270878155,
      0.231915945590847,
      0.136408560596887
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: P Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(85.4, 129.4, 160.6)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0275457089376622,
      0.010232500860221,
      0.00619687864141861,
      0.00154840746479006,
      0.0122511581699971,
      0.00739989997462664,
      0.00780625535056291,
      0.00479412437451332
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: P Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(45.0, 100.0, 139.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0302355808026618,
      0.0319667343909137,
      0.0321052519134661,
      0.0978540084903627,
      0.0177774193410772,
      0.00451762066100246,
      0.000780741935607597,
      0.0029918510117005
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: Baseline SPI<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(198.8, 216.4, 205.8)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0795474682095698,
      0.00131275109863953,
      0.00627856511112067,
      0.00247440350214788,
      0.00874434295995802,
      0.00776440019959916,
      0.0190721617498411,
      0.00953260367927569
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: SPI Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(150.6, 185.8, 164.6)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0225572814928903,
      0.00792164974103749,
      0.0846024765813725,
      0.0529517802076257,
      0.00310187699368342,
      0.0682832931343998,
      0.0306006662428488,
      0.0314999816344278
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: SPI Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(102.39999999999998, 155.2, 123.39999999999999)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0281838976386098,
      0.000692448725594486,
      0.0349857543926762,
      0.00277549718410603,
      0.0390720639053222,
      0.0229465642561432,
      0.0119488840146506,
      0.0407629104901863
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: SPI Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(54.19999999999999, 124.6, 82.19999999999999)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0400917721002748,
      0.00787236330063492,
      0.00983460192310968,
      0.00312052768290389,
      0.00473207729501713,
      0.0035447763821791,
      0.00236751784619095,
      0.00890661325250423
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคเหนือ<br>Crop: %{y}<br>Var: SPI Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(6.0, 94.0, 41.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00384973181029475,
      0.00691630729273951,
      0.0117491049681836,
      0.0173985918538767,
      0.0116795956810271,
      0.00641690612737653,
      0.00385481917237961,
      0.00249498474387959
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x2",
    "yaxis": "y2"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: Baseline T<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(214.0, 199.6, 223.6)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0744142615460009,
      0.00173203171870983,
      0.01707273502041,
      0.00178813462378601,
      0.00779706407791528,
      0.0149639622196461,
      0.00473428161414842,
      0.00694547273831324
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: T Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(181.0, 152.2, 200.2)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0646542718493569,
      0.0449782442573686,
      0.00471931035824625,
      0.0648551127610926,
      0.129471577627883,
      0.00506898441754768,
      0.0333247015312087,
      0.0111414446737086
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: T Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(148.0, 104.80000000000001, 176.8)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0741400473781687,
      0.00205174062155741,
      0.0864553915272445,
      0.0016076440967729,
      0.0177176404623091,
      0.0140445452180247,
      0.00438049148971797,
      0.0205722054316824
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: T Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(115.0, 57.400000000000006, 153.4)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00616260800773088,
      0.0129843644681366,
      0.012232246346865,
      0.0039006920611342,
      0.00516264807696205,
      0.0259358668631,
      0.00532997094813652,
      0.0085956559943202
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: T Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(82.0, 10.0, 130.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0448994909297813,
      0.0293564147317026,
      0.00920031723651384,
      0.0218096203293905,
      0.00354719303729361,
      0.025116582250196,
      0.0288633476270158,
      0.0252355841085906
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: Baseline P<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(206.6, 217.6, 225.4)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0631330009487788,
      0.00223072572470125,
      0.0420190739637558,
      0.00170533212074207,
      0.00995895674827205,
      0.0186258781919589,
      0.00683669840392105,
      0.00626644015460163
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: P Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(166.2, 188.2, 203.8)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.120206045155501,
      0.0107350006645212,
      0.0179422666823963,
      0.0178513272834726,
      0.0238034791924926,
      0.0113258973957143,
      0.00982151733720922,
      0.0348727683009654
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: P Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(125.80000000000001, 158.8, 182.2)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0839236197971574,
      0.00398671261755015,
      0.0561377696165578,
      0.00206147980367533,
      0.0326717979676764,
      0.0113019926625099,
      0.00267451159713478,
      0.00414671242660257
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: P Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(85.4, 129.4, 160.6)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0106376732295816,
      0.0269874533763864,
      0.00377166615353584,
      0.00262934456302008,
      0.00673722681645686,
      0.0329844943851692,
      0.00280087621768707,
      0.0313639830025684
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: P Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(45.0, 100.0, 139.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00170978510596717,
      0.0562679135311764,
      0.00115585588702269,
      0.0706811521745409,
      0.0271558948560509,
      0.00118813512735269,
      0.0145202111283057,
      0.00475470835245701
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: Baseline SPI<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(198.8, 216.4, 205.8)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0429694294201711,
      0.00778169155818402,
      0.0118647273423557,
      0.00642195956705459,
      0.0177355323706139,
      0.0107586044038133,
      0.0112182337682539,
      0.00354902648101828
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: SPI Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(150.6, 185.8, 164.6)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.110656238127596,
      0.0206185348727977,
      0.016427175831696,
      0.0327693320681906,
      0.0743910406957366,
      0.0137443360084722,
      0.0354611446895828,
      0.0339308503887362
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: SPI Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(102.39999999999998, 155.2, 123.39999999999999)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0508269774855247,
      0.00373281760098544,
      0.0737703285702852,
      0.00232523603155848,
      0.0114540501609547,
      0.0148505611971532,
      0.00362587443360665,
      0.028802860583467
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: SPI Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(54.19999999999999, 124.6, 82.19999999999999)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00255272128533205,
      0.0677318328908942,
      0.00944238069903463,
      0.0056898726541412,
      0.0115812765244713,
      0.00733767790904807,
      0.00161927466774036,
      0.00647588216000487
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคตะวันออกเฉียงเหนือ<br>Crop: %{y}<br>Var: SPI Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(6.0, 94.0, 41.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00262190484094824,
      0.0112131742909104,
      0.0035216779112093,
      0.0134750251645876,
      0.0192837255456737,
      0.00139405349370793,
      0.0159648609942867,
      0.0020282566773272
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวโพดเลี้ยงสัตว์",
      "อ้อย",
      "มันสำปะหลัง",
      "ข้าวเหนียว",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x3",
    "yaxis": "y3"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: Baseline T<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(214.0, 199.6, 223.6)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0804190549551336,
      0.00488393930778046,
      0.196477041810567,
      0.0310904077883404
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: T Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(181.0, 152.2, 200.2)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0202877679907373,
      0.0667021155953643,
      0.0226711459852811,
      0.150244752175155
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: T Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(148.0, 104.80000000000001, 176.8)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0219394020581542,
      0.00418172147519292,
      0.0557847441616146,
      0.0213867144271716
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: T Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(115.0, 57.400000000000006, 153.4)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0175469871901578,
      0.0511090705052364,
      0.00780763595043352,
      0.0299025954475235
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: T Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "อุณหภูมิ (T)",
    "legendgrouptitle": {
      "text": "<b>อุณหภูมิ (T)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(82.0, 10.0, 130.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0335176148080421,
      0.0856606391115366,
      0.00778786593969637,
      0.0105336330708578
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: Baseline P<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(206.6, 217.6, 225.4)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0333754353223937,
      0.00259219305560719,
      0.0752295749581681,
      0.0133449964485296
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: P Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(166.2, 188.2, 203.8)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0295563945996919,
      0.00804386009329946,
      0.143369288905949,
      0.0410171259038147
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: P Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(125.80000000000001, 158.8, 182.2)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0151877299730536,
      0.00245556305091257,
      0.0300293445787746,
      0.0794417511877051
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: P Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(85.4, 129.4, 160.6)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00733434383802992,
      0.033540878374174,
      0.00386495288866973,
      0.0284652290398557
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: P Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ปริมาณน้ำฝน (P)",
    "legendgrouptitle": {
      "text": "<b>ปริมาณน้ำฝน (P)</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(45.0, 100.0, 139.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00327434929474725,
      0.0720737894557258,
      0.00214528676792027,
      0.0303248398259439
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: Baseline SPI<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 1000,
    "marker": {
      "color": "rgb(198.8, 216.4, 205.8)"
    },
    "name": "Baseline",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0193647620693491,
      0.00843307073124537,
      0.0171180555660771,
      0.00583715625417511
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: SPI Trend<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 999,
    "marker": {
      "color": "rgb(150.6, 185.8, 164.6)"
    },
    "name": "Trend",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0416737808014395,
      0.0395119458882699,
      0.0347921379122525,
      0.166955154065811
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: SPI Seasonal<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 998,
    "marker": {
      "color": "rgb(102.39999999999998, 155.2, 123.39999999999999)"
    },
    "name": "Seasonal",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0352440774343876,
      0.00375667225674619,
      0.0370485917145438,
      0.0138623274096919
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: SPI Idiosyncratic<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 997,
    "marker": {
      "color": "rgb(54.19999999999999, 124.6, 82.19999999999999)"
    },
    "name": "Idiosyncratic",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.0218283486301757,
      0.113796987998752,
      0.00642027621957765,
      0.00178476198250777
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  },
  {
    "hovertemplate": "Region: ภาคใต้<br>Crop: %{y}<br>Var: SPI Covariate<br>Value: %{x:.2%}<extra></extra>",
    "legendgroup": "ดัชนี SPI-3",
    "legendgrouptitle": {
      "text": "<b>ดัชนี SPI-3</b>"
    },
    "legendrank": 996,
    "marker": {
      "color": "rgb(6.0, 94.0, 41.0)"
    },
    "name": "Covariate",
    "orientation": "h",
    "showlegend": false,
    "width": 0.5,
    "x": [
      0.00371964322317566,
      0.0197611508552672,
      0.00258220818910075,
      0.0323340621975013
    ],
    "y": [
      "ทุเรียน",
      "ยางพารา",
      "ข้าวเจ้า",
      "ข้าวหอมมะลิ"
    ],
    "type": "bar",
    "xaxis": "x4",
    "yaxis": "y4"
  }
]}
  layout={{
  "template": {
    "data": {
      "histogram2dcontour": [
        {
          "type": "histogram2dcontour",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          },
          "colorscale": [
            [
              0.0,
              "#0d0887"
            ],
            [
              0.1111111111111111,
              "#46039f"
            ],
            [
              0.2222222222222222,
              "#7201a8"
            ],
            [
              0.3333333333333333,
              "#9c179e"
            ],
            [
              0.4444444444444444,
              "#bd3786"
            ],
            [
              0.5555555555555556,
              "#d8576b"
            ],
            [
              0.6666666666666666,
              "#ed7953"
            ],
            [
              0.7777777777777778,
              "#fb9f3a"
            ],
            [
              0.8888888888888888,
              "#fdca26"
            ],
            [
              1.0,
              "#f0f921"
            ]
          ]
        }
      ],
      "choropleth": [
        {
          "type": "choropleth",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          }
        }
      ],
      "histogram2d": [
        {
          "type": "histogram2d",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          },
          "colorscale": [
            [
              0.0,
              "#0d0887"
            ],
            [
              0.1111111111111111,
              "#46039f"
            ],
            [
              0.2222222222222222,
              "#7201a8"
            ],
            [
              0.3333333333333333,
              "#9c179e"
            ],
            [
              0.4444444444444444,
              "#bd3786"
            ],
            [
              0.5555555555555556,
              "#d8576b"
            ],
            [
              0.6666666666666666,
              "#ed7953"
            ],
            [
              0.7777777777777778,
              "#fb9f3a"
            ],
            [
              0.8888888888888888,
              "#fdca26"
            ],
            [
              1.0,
              "#f0f921"
            ]
          ]
        }
      ],
      "heatmap": [
        {
          "type": "heatmap",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          },
          "colorscale": [
            [
              0.0,
              "#0d0887"
            ],
            [
              0.1111111111111111,
              "#46039f"
            ],
            [
              0.2222222222222222,
              "#7201a8"
            ],
            [
              0.3333333333333333,
              "#9c179e"
            ],
            [
              0.4444444444444444,
              "#bd3786"
            ],
            [
              0.5555555555555556,
              "#d8576b"
            ],
            [
              0.6666666666666666,
              "#ed7953"
            ],
            [
              0.7777777777777778,
              "#fb9f3a"
            ],
            [
              0.8888888888888888,
              "#fdca26"
            ],
            [
              1.0,
              "#f0f921"
            ]
          ]
        }
      ],
      "contourcarpet": [
        {
          "type": "contourcarpet",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          }
        }
      ],
      "contour": [
        {
          "type": "contour",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          },
          "colorscale": [
            [
              0.0,
              "#0d0887"
            ],
            [
              0.1111111111111111,
              "#46039f"
            ],
            [
              0.2222222222222222,
              "#7201a8"
            ],
            [
              0.3333333333333333,
              "#9c179e"
            ],
            [
              0.4444444444444444,
              "#bd3786"
            ],
            [
              0.5555555555555556,
              "#d8576b"
            ],
            [
              0.6666666666666666,
              "#ed7953"
            ],
            [
              0.7777777777777778,
              "#fb9f3a"
            ],
            [
              0.8888888888888888,
              "#fdca26"
            ],
            [
              1.0,
              "#f0f921"
            ]
          ]
        }
      ],
      "surface": [
        {
          "type": "surface",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          },
          "colorscale": [
            [
              0.0,
              "#0d0887"
            ],
            [
              0.1111111111111111,
              "#46039f"
            ],
            [
              0.2222222222222222,
              "#7201a8"
            ],
            [
              0.3333333333333333,
              "#9c179e"
            ],
            [
              0.4444444444444444,
              "#bd3786"
            ],
            [
              0.5555555555555556,
              "#d8576b"
            ],
            [
              0.6666666666666666,
              "#ed7953"
            ],
            [
              0.7777777777777778,
              "#fb9f3a"
            ],
            [
              0.8888888888888888,
              "#fdca26"
            ],
            [
              1.0,
              "#f0f921"
            ]
          ]
        }
      ],
      "mesh3d": [
        {
          "type": "mesh3d",
          "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
          }
        }
      ],
      "scatter": [
        {
          "fillpattern": {
            "fillmode": "overlay",
            "size": 10,
            "solidity": 0.2
          },
          "type": "scatter"
        }
      ],
      "parcoords": [
        {
          "type": "parcoords",
          "line": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scatterpolargl": [
        {
          "type": "scatterpolargl",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "bar": [
        {
          "error_x": {
            "color": "#2a3f5f"
          },
          "error_y": {
            "color": "#2a3f5f"
          },
          "marker": {
            "line": {
              "color": "#E5ECF6",
              "width": 0.5
            },
            "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
            }
          },
          "type": "bar"
        }
      ],
      "scattergeo": [
        {
          "type": "scattergeo",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scatterpolar": [
        {
          "type": "scatterpolar",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "histogram": [
        {
          "marker": {
            "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
            }
          },
          "type": "histogram"
        }
      ],
      "scattergl": [
        {
          "type": "scattergl",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scatter3d": [
        {
          "type": "scatter3d",
          "line": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          },
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scattermap": [
        {
          "type": "scattermap",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scattermapbox": [
        {
          "type": "scattermapbox",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scatterternary": [
        {
          "type": "scatterternary",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "scattercarpet": [
        {
          "type": "scattercarpet",
          "marker": {
            "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
            }
          }
        }
      ],
      "carpet": [
        {
          "aaxis": {
            "endlinecolor": "#2a3f5f",
            "gridcolor": "white",
            "linecolor": "white",
            "minorgridcolor": "white",
            "startlinecolor": "#2a3f5f"
          },
          "baxis": {
            "endlinecolor": "#2a3f5f",
            "gridcolor": "white",
            "linecolor": "white",
            "minorgridcolor": "white",
            "startlinecolor": "#2a3f5f"
          },
          "type": "carpet"
        }
      ],
      "table": [
        {
          "cells": {
            "fill": {
              "color": "#EBF0F8"
            },
            "line": {
              "color": "white"
            }
          },
          "header": {
            "fill": {
              "color": "#C8D4E3"
            },
            "line": {
              "color": "white"
            }
          },
          "type": "table"
        }
      ],
      "barpolar": [
        {
          "marker": {
            "line": {
              "color": "#E5ECF6",
              "width": 0.5
            },
            "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
            }
          },
          "type": "barpolar"
        }
      ],
      "pie": [
        {
          "automargin": true,
          "type": "pie"
        }
      ]
    },
    "layout": {
      "autotypenumbers": "strict",
      "colorway": [
        "#636efa",
        "#EF553B",
        "#00cc96",
        "#ab63fa",
        "#FFA15A",
        "#19d3f3",
        "#FF6692",
        "#B6E880",
        "#FF97FF",
        "#FECB52"
      ],
      "font": {
        "color": "#2a3f5f"
      },
      "hovermode": "closest",
      "hoverlabel": {
        "align": "left"
      },
      "paper_bgcolor": "white",
      "plot_bgcolor": "#E5ECF6",
      "polar": {
        "bgcolor": "#E5ECF6",
        "angularaxis": {
          "gridcolor": "white",
          "linecolor": "white",
          "ticks": ""
        },
        "radialaxis": {
          "gridcolor": "white",
          "linecolor": "white",
          "ticks": ""
        }
      },
      "ternary": {
        "bgcolor": "#E5ECF6",
        "aaxis": {
          "gridcolor": "white",
          "linecolor": "white",
          "ticks": ""
        },
        "baxis": {
          "gridcolor": "white",
          "linecolor": "white",
          "ticks": ""
        },
        "caxis": {
          "gridcolor": "white",
          "linecolor": "white",
          "ticks": ""
        }
      },
      "coloraxis": {
        "colorbar": {
          "outlinewidth": 0,
          "ticks": ""
        }
      },
      "colorscale": {
        "sequential": [
          [
            0.0,
            "#0d0887"
          ],
          [
            0.1111111111111111,
            "#46039f"
          ],
          [
            0.2222222222222222,
            "#7201a8"
          ],
          [
            0.3333333333333333,
            "#9c179e"
          ],
          [
            0.4444444444444444,
            "#bd3786"
          ],
          [
            0.5555555555555556,
            "#d8576b"
          ],
          [
            0.6666666666666666,
            "#ed7953"
          ],
          [
            0.7777777777777778,
            "#fb9f3a"
          ],
          [
            0.8888888888888888,
            "#fdca26"
          ],
          [
            1.0,
            "#f0f921"
          ]
        ],
        "sequentialminus": [
          [
            0.0,
            "#0d0887"
          ],
          [
            0.1111111111111111,
            "#46039f"
          ],
          [
            0.2222222222222222,
            "#7201a8"
          ],
          [
            0.3333333333333333,
            "#9c179e"
          ],
          [
            0.4444444444444444,
            "#bd3786"
          ],
          [
            0.5555555555555556,
            "#d8576b"
          ],
          [
            0.6666666666666666,
            "#ed7953"
          ],
          [
            0.7777777777777778,
            "#fb9f3a"
          ],
          [
            0.8888888888888888,
            "#fdca26"
          ],
          [
            1.0,
            "#f0f921"
          ]
        ],
        "diverging": [
          [
            0,
            "#8e0152"
          ],
          [
            0.1,
            "#c51b7d"
          ],
          [
            0.2,
            "#de77ae"
          ],
          [
            0.3,
            "#f1b6da"
          ],
          [
            0.4,
            "#fde0ef"
          ],
          [
            0.5,
            "#f7f7f7"
          ],
          [
            0.6,
            "#e6f5d0"
          ],
          [
            0.7,
            "#b8e186"
          ],
          [
            0.8,
            "#7fbc41"
          ],
          [
            0.9,
            "#4d9221"
          ],
          [
            1,
            "#276419"
          ]
        ]
      },
      "xaxis": {
        "gridcolor": "white",
        "linecolor": "white",
        "ticks": "",
        "title": {
          "standoff": 15
        },
        "zerolinecolor": "white",
        "automargin": true,
        "zerolinewidth": 2
      },
      "yaxis": {
        "gridcolor": "white",
        "linecolor": "white",
        "ticks": "",
        "title": {
          "standoff": 15
        },
        "zerolinecolor": "white",
        "automargin": true,
        "zerolinewidth": 2
      },
      "scene": {
        "xaxis": {
          "backgroundcolor": "#E5ECF6",
          "gridcolor": "white",
          "linecolor": "white",
          "showbackground": true,
          "ticks": "",
          "zerolinecolor": "white",
          "gridwidth": 2
        },
        "yaxis": {
          "backgroundcolor": "#E5ECF6",
          "gridcolor": "white",
          "linecolor": "white",
          "showbackground": true,
          "ticks": "",
          "zerolinecolor": "white",
          "gridwidth": 2
        },
        "zaxis": {
          "backgroundcolor": "#E5ECF6",
          "gridcolor": "white",
          "linecolor": "white",
          "showbackground": true,
          "ticks": "",
          "zerolinecolor": "white",
          "gridwidth": 2
        }
      },
      "shapedefaults": {
        "line": {
          "color": "#2a3f5f"
        }
      },
      "annotationdefaults": {
        "arrowcolor": "#2a3f5f",
        "arrowhead": 0,
        "arrowwidth": 1
      },
      "geo": {
        "bgcolor": "white",
        "landcolor": "#E5ECF6",
        "subunitcolor": "white",
        "showland": true,
        "showlakes": true,
        "lakecolor": "white"
      },
      "title": {
        "x": 0.05
      },
      "mapbox": {
        "style": "light"
      }
    }
  },
  "xaxis": {
    "anchor": "y",
    "domain": [
      0.0,
      1.0
    ],
    "matches": "x4",
    "showticklabels": false,
    "range": [
      0,
      0.8
    ],
    "tickformat": ".0%",
    "showgrid": true,
    "gridcolor": "#BDBDBD",
    "gridwidth": 1,
    "zeroline": false
  },
  "yaxis": {
    "anchor": "x",
    "domain": [
      0.7485714285714286,
      1.0
    ],
    "showgrid": false,
    "ticksuffix": "  ",
    "title": {}
  },
  "xaxis2": {
    "anchor": "y2",
    "domain": [
      0.0,
      1.0
    ],
    "matches": "x4",
    "showticklabels": false,
    "range": [
      0,
      0.8
    ],
    "tickformat": ".0%",
    "showgrid": true,
    "gridcolor": "#BDBDBD",
    "gridwidth": 1,
    "zeroline": false
  },
  "yaxis2": {
    "anchor": "x2",
    "domain": [
      0.45714285714285713,
      0.7085714285714285
    ],
    "showgrid": false,
    "ticksuffix": "  ",
    "title": {}
  },
  "xaxis3": {
    "anchor": "y3",
    "domain": [
      0.0,
      1.0
    ],
    "matches": "x4",
    "showticklabels": false,
    "range": [
      0,
      0.8
    ],
    "tickformat": ".0%",
    "showgrid": true,
    "gridcolor": "#BDBDBD",
    "gridwidth": 1,
    "zeroline": false
  },
  "yaxis3": {
    "anchor": "x3",
    "domain": [
      0.1657142857142857,
      0.4171428571428571
    ],
    "showgrid": false,
    "ticksuffix": "  ",
    "title": {}
  },
  "xaxis4": {
    "anchor": "y4",
    "domain": [
      0.0,
      1.0
    ],
    "range": [
      0,
      0.8
    ],
    "tickformat": ".0%",
    "showgrid": true,
    "gridcolor": "#BDBDBD",
    "gridwidth": 1,
    "zeroline": false
  },
  "yaxis4": {
    "anchor": "x4",
    "domain": [
      0.0,
      0.1257142857142857
    ],
    "showgrid": false,
    "ticksuffix": "  ",
    "title": {}
  },
  "annotations": [
    {
      "font": {
        "color": "black",
        "size": 24
      },
      "showarrow": false,
      "text": "<b>ภาคกลาง</b>",
      "x": -0.22,
      "xanchor": "right",
      "xref": "paper",
      "y": 0.5,
      "yref": "y domain"
    },
    {
      "font": {
        "color": "black",
        "size": 24
      },
      "showarrow": false,
      "text": "<b>ภาคเหนือ</b>",
      "x": -0.22,
      "xanchor": "right",
      "xref": "paper",
      "y": 0.5,
      "yref": "y2 domain"
    },
    {
      "font": {
        "color": "black",
        "size": 24
      },
      "showarrow": false,
      "text": "<b>ภาคตะวันออกเฉียงเหนือ</b>",
      "x": -0.22,
      "xanchor": "right",
      "xref": "paper",
      "y": 0.5,
      "yref": "y3 domain"
    },
    {
      "font": {
        "color": "black",
        "size": 24
      },
      "showarrow": false,
      "text": "<b>ภาคใต้</b>",
      "x": -0.22,
      "xanchor": "right",
      "xref": "paper",
      "y": 0.5,
      "yref": "y4 domain"
    }
  ],
  "font": {
    "size": 24,
    "color": "black"
  },
  "hoverlabel": {
    "font": {
      "size": 20,
      "color": "black"
    },
    "bgcolor": "white"
  },
  "margin": {
    "l": 450,
    "r": 250,
    "t": 50,
    "b": 80
  },
  "legend": {
    "x": 1.02,
    "y": 1,
    "tracegroupgap": 20,
    "xanchor": "left"
  },
  "barmode": "stack",
  "paper_bgcolor": "white",
  "plot_bgcolor": "white",
  "height": 1860,
  "width": 1500
}}
/>